Acquiring state lock. This may take a few moments...
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-01c9840682d14e4a1]
module.nat.aws_eip.nat_eip: Refreshing state... [id=eipalloc-02cea8f5f445aad0d]
module.eks_roles.aws_iam_role.eks_cluster_role: Refreshing state... [id=EKSClusterRole]
module.eks_roles.aws_iam_role.eks_node_role: Refreshing state... [id=EKSNodeInstanceRole]
module.eks_roles.aws_iam_role_policy_attachment.eks_cluster_attach: Refreshing state... [id=EKSClusterRole-20250527075328285200000003]
module.eks_roles.aws_iam_role_policy_attachment.ec2_container_registry_read_only: Refreshing state... [id=EKSNodeInstanceRole-20250527075328150600000001]
module.eks_roles.aws_iam_role_policy_attachment.eks_cni: Refreshing state... [id=EKSNodeInstanceRole-20250527075328166700000002]
module.eks_roles.aws_iam_role_policy_attachment.eks_worker_node: Refreshing state... [id=EKSNodeInstanceRole-20250527075328287200000004]
module.igw.aws_internet_gateway.this: Refreshing state... [id=igw-0c79d94a14cf7d74a]
module.subnet.aws_subnet.private_4d: Refreshing state... [id=subnet-0ba31720170fe6410]
module.subnet.aws_subnet.private_3b: Refreshing state... [id=subnet-0ecf5e459106da226]
module.subnet.aws_subnet.public_2c: Refreshing state... [id=subnet-077687b17dde8a877]
module.route.aws_route_table.public: Refreshing state... [id=rtb-024707a66260255d6]
module.route.aws_route_table.private: Refreshing state... [id=rtb-0a9f645215367193f]
module.subnet.aws_subnet.public_1a: Refreshing state... [id=subnet-0d3c44264679d4f7d]
module.eks.aws_eks_cluster.this: Refreshing state... [id=news-cluster]
module.route.aws_route_table_association.private_1: Refreshing state... [id=rtbassoc-081b81dd08f2d60f8]
module.route.aws_route_table_association.private_2: Refreshing state... [id=rtbassoc-04d730e3d8d1e3380]
module.route.aws_route_table_association.public_2: Refreshing state... [id=rtbassoc-00fb3946c3a716876]
module.route.aws_route_table_association.public_1: Refreshing state... [id=rtbassoc-053e0703fd0e86760]
module.nat.aws_nat_gateway.nat: Refreshing state... [id=nat-06a7249eda9a787fa]
module.route.aws_route.private_route: Refreshing state... [id=r-rtb-0a9f645215367193f1080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.eks.aws_eks_node_group.default will be created
  + resource "aws_eks_node_group" "default" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "news-cluster"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.medium",
        ]
      + node_group_name        = "news-cluster-ng"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = "arn:aws:iam::635140758252:role/EKSNodeInstanceRole"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-0ba31720170fe6410",
          + "subnet-0ecf5e459106da226",
        ]
      + tags                   = {
          + "Name" = "news-cluster-ng"
        }
      + tags_all               = {
          + "Name" = "news-cluster-ng"
        }
      + version                = (known after apply)

      + node_repair_config (known after apply)

      + scaling_config {
          + desired_size = 2
          + max_size     = 3
          + min_size     = 1
        }

      + update_config (known after apply)
    }

  # module.route.aws_route.public_route will be created
  + resource "aws_route" "public_route" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = "igw-0c79d94a14cf7d74a"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = "rtb-024707a66260255d6"
      + state                  = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

<!-- Sticky Pull Request Comment -->